const doctors = [
  {
    id: 1,
    name: "د. محمد عثمان",
    specialty: "الجهاز الهضمي",
    phone: "غير متوفر",
    bio: "استشاري باطنية بخبرة 12 سنة ويجري عمليات المنظار.",
    hospital: "مستشفى عافية",
    schedule: [
      { day: "السبت", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأحد", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الاثنين", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الثلاثاء", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأربعاء", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الخميس", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الجمعة", time: "إجازة", place: "إجازة" }
    ]
  },

  {
    id: 2,
    name: "د. وضاح حبتور",
    specialty: "جراحة عامة",
    phone: "غير متوفر",
    bio: "جراح عام ومناظير.",
    hospital: "مستشفى العاصمة",
    schedule: [
      { day: "السبت", time: "8–2 و 4–8", place: "مستشفى العاصمة" },
      { day: "الأحد", time: "8–2 و 4–8", place: "مستشفى العاصمة" },
      { day: "الاثنين", time: "8–2 و 4–8", place: "مستشفى السلام" },
      { day: "الثلاثاء", time: "8–2 و 4–8", place: "مستشفى السلام" },
      { day: "الأربعاء", time: "8–2 و 4–8", place: "مستشفى العاصمة" },
      { day: "الخميس", time: "8–2 و 4–8", place: "مستشفى العاصمة" },
      { day: "الجمعة", time: "إجازة", place: "إجازة" }
    ]
  },

  {
    id: 3,
    name: "د. عبدالعزيز الشكلية",
    specialty: "تخصص قلب",
    phone: "غير متوفر",
    bio: "مستشار قلبي.",
    hospital: "مستشفى عافية",
    schedule: [
      { day: "السبت", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأحد", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الاثنين", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الثلاثاء", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأربعاء", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الخميس", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الجمعة", time: "إجازة", place: "إجازة" }
    ]
  },

  {
    id: 4,
    name: "د. عبدالله طرموم",
    specialty: "أذن أنف حنجرة",
    phone: "غير متوفر",
    bio: "يجري عمليات.",
    hospital: "مستشفى عافية",
    schedule: [
      { day: "السبت", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأحد", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الاثنين", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الثلاثاء", time: "8–2 و 4–8", place: "المستشفى الحكومي" },
      { day: "الأربعاء", time: "8–2 و 4–8", place: "المستشفى الحكومي" },
      { day: "الخميس", time: "8–2 و 4–8", place: "المستشفى الحكومي" },
      { day: "الجمعة", time: "إجازة", place: "إجازة" }
    ]
  },

  {
    id: 5,
    name: "د. محمد يوسف",
    specialty: "عظام",
    phone: "غير متوفر",
    bio: "يجري عمليات.",
    hospital: "مستشفى عافية",
    schedule: [
      { day: "السبت", time: "8–2 و 4–8", place: "مستشفى عافية" },
      { day: "الأحد",
