// === نموذج جاهز لكل طبيب مع الأيام + وقت الدوام + مكان الدوام ===
// انسخ أي دكتور وغير الاسم/التخصص/المكان/الوقت حسب الحاجة

const doctors = [
  {
    id: 1,
    name: "د. محمد عثمان ",
    specialty: "الجهاز الهضمي ",
    phone: "غير متوفر",
    bio: "استشاري باطنية بخبرة 12 سنة ويجري عمليات المنظار .",
    schedule: {
      "السبت":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",  times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",           times: ["اجازة"] }
    }
  },
{
  id: 2,
    name: "د. وضاح حبتور ",
    specialty: "جراحة عامة",
    phone: "غير متوفر",
    bio: "جراح عام ومناظير.",
    schedule: {
      "السبت":   { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى السلام",       times: [" 8 صباحا -2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى السلام",       times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى العاصمة",     times: ["8 صباحا–2 مساء", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",              times: ["اجازه"] }
    }
  },

  {
    id: 3,
    name: "د. عبدالعزيز الشكلية ",
    specialty: "تخصص قلب",
    phone: "غير متوفر",
    bio: "مستشار قلبي ",
    schedule: {
      "السبت":   { place: "مستشفى عافية",      times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",       times: [" 8 صباحا -2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",       times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا–2 مساء", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",              times: ["إجازة"] }
    }
  },
{
   id: 4,
    name: "د. عبدالله طرموم",
    specialty: "ادن انف حنجرة",
    phone: "غير متوفر",
    bio: "يجري عمليات",
    schedule: {
      "السبت":   { place: "مستشفى عافية",      times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",      times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",        times: [" 8 صباحا -2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "المستشفى الحكومي",       times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "المستشفى الحكومي",    times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "المستشفى الحكومي",    times: ["8 صباحا–2 مساء", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",              times: ["لا يوجد"] }
    }
  },

  {
   id: 5,
    name: "د. محمد يوسف",
    specialty: " عظام",
    phone: "غير متوفر",
    bio: "يجري عمليات",
     schedule: {
      "السبت":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",  times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",           times: ["اجازة"] }
    }
  },

  {
   id: 6,
    name: "د. تركي الشيخ",
    specialty: "باطني",
    phone: "غير متوفر",
    bio: "استشاري باطنية",
     schedule: {
      "السبت":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",  times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",           times: ["اجازة"] }
    }
  },

  {
   id: 7,
    name: "د. حسان",
    specialty: "أدن أنف حنجرة",
    phone: "غير متوفر",
    bio: "يجري عمليات",
    schedule: {
      "السبت":   { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى العاصمة",       times: [" 8 صباحا -2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى العاصمة",      times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى العاصمة",     times: ["8 صباحا –2 مساء", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى العاصمة",     times: ["8 صباحا–2 مساء", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",              times: ["إجازة"] }
    }
  },
  {
   id: 8,
    name: "د. تسنيم مصر",
    specialty: "نساء وولادة",
    phone: "غير متوفر",
    bio: "نساء وولاده",
     schedule: {
      "السبت":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",  times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",           times: ["اجازة"] }
    }
  },

  {
   id: 9,
    name: "د. زينب",
    specialty: "تغدية",
    phone: "غير متوفر",
    bio: "أخصاىيةتغدية",
     schedule: {
      "السبت":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأحد":   { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الاثنين": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الثلاثاء": { place: "مستشفى عافية",  times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الأربعاء": { place: "مستشفى عافية",    times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الخميس":  { place: "مستشفى عافية",     times: ["8 صباحا –2 مساء ", " 4 مساء –8 مساء"] },
      "الجمعة":  { place: "إجازة",           times: ["اجازة"] }
    }
  },


  // 🔥 يمكنك إضافة بقية الأطباء بنفس النموذج
];
